<script setup lang="ts">
import { ISong } from '@/components/tw-music/type'



const songs: ISong[] = [
    {
        name: '时间煮雨',
        url: 'http://music.163.com/song/media/outer/url?id=26562741.mp3',
        cover: 'http://p2.music.126.net/6-tqeY2U5pAePa3vKSuM5w==/19034745300240313.jpg?param=300x300',
        lyrics: `
        [00:01.50]时间煮雨
[00:03.99]作词：郭敬明、落落
[00:06.65]作曲：武部聪志
[00:09.65]编曲：刘大江
[00:12.59]演唱：郁可唯
[00:15.30]
[00:26.42]风吹雨成花
[00:31.98]时间追不上白马
[00:37.69]你年少掌心的梦话
[00:42.61]依然紧握着吗
[00:47.67]
[00:49.07]云翻涌成夏
[00:54.51]眼泪被岁月蒸发
[01:00.20]这条路上的你我她
[01:05.18]有谁迷路了吗
[01:10.79]
[01:14.33]我们说好不分离
[01:19.01]要一直一直在一起
[01:25.61]就算与时间为敌
[01:30.16]就算与全世界背离
[01:42.02]
[01:48.15]风吹亮雪花
[01:53.70]吹白我们的头发
[01:59.28]当初说一起闯天下
[02:04.04]你们还记得吗
[02:09.13]
[02:10.66]那一年盛夏
[02:16.25]心愿许的无限大
[02:22.03]我们手拉手也成舟
[02:26.79]划过悲伤河流
[02:31.94]
[02:36.11]你曾说过不分离
[02:40.77]要一直一直在一起
[02:47.29]现在我想问问你
[02:51.99]是否只是童言无忌
[02:57.37]
[02:58.61]天真岁月不忍欺
[03:03.12]青春荒唐我不负你
[03:09.88]大雪求你别抹去
[03:14.40]我们在一起的痕迹
[03:20.50]
[03:21.32]大雪也无法抹去
[03:25.75]我们给彼此的印记
[03:32.50]今夕何夕
[03:38.11]青草离离
[03:43.84]明月夜送君千里
[03:48.84]等来年 秋风起
[03:55.39]
        `,
        artist: '郁可唯',
    },
    {
        name: '保留',
        url: 'http://music.163.com/song/media/outer/url?id=442869203.mp3',
        cover: 'http://p2.music.126.net/wSMfGvFzOAYRU_yVIfquAA==/2946691248081599.jpg?param=300x300',
        lyrics: `[00:00.07]保留
[00:00.17]
[00:00.27]作词：郭顶
[00:00.37]作曲：郭顶
[00:00.47]演唱：郭顶
[00:00.57]
[00:00.90]看见 你在我眼前
[00:06.83]不去猜想我们隔多远
[00:15.46]当我 夜幕中准备
[00:21.43]只想让沉默的能开解
[00:30.62]在不同的遭遇里我发现你的瞬间
[00:37.29]有种不可言说的温柔直觉
[00:44.85]在有限的深夜消失之前触摸你的脸
[00:52.14]我情愿这是幻觉 也不愿是种告别
[00:58.60]已经忘了 你的名字
[01:05.69]就在这座 寂静星石
[01:13.12]怎么还有 你的样子
[01:21.73]被保留
[01:36.78]给我 一整个拥抱
[01:42.76]好让我不至于 太潦倒
[01:51.46]时间 过一分一秒
[01:57.42]还是觉得相遇 太美好
[02:06.55]在不同的遭遇里我发现你的瞬间
[02:13.40]有种不可言说的温柔直觉
[02:20.70]当不远的蓝色渐渐显现这无边境界
[02:28.22]我始终等待再见 只不愿再也不见
[02:34.63]已经忘了 你的名字
[02:41.72]就在这座 寂静星石
[02:49.04]怎么还有 你的样子
[02:57.61]想形容你的句子 关于你所有心事
[03:05.06]一眼能及的钻石 哪一个是你地址
[03:12.10]忘了 你的名字
[03:18.65]就在这座 寂静星石
[03:25.89]怎么还有 你的样子
[03:34.67]我始终等待再见 只不愿再也不见
[03:41.21]真的忘了 你的名字
[03:48.15]是在哪座 寂静星石
[03:55.51]一直还有 你的样子
[04:04.30]被保留
[04:06.89]`,
        artist: '郭顶',
    },
    {
        name: '凄美的',
        url: 'http://music.163.com/song/media/outer/url?id=436346833.mp3',
        cover: 'http://p2.music.126.net/wSMfGvFzOAYRU_yVIfquAA==/2946691248081599.jpg?param=300x300',
        lyrics: '',
        artist: '郭顶',
    },
    {
        name: '水星记',
        url: 'http://music.163.com/song/media/outer/url?id=441491828.mp3',
        cover: 'http://p2.music.126.net/wSMfGvFzOAYRU_yVIfquAA==/2946691248081599.jpg?param=300x300',
        lyrics: '',
        artist: '郭顶',
    },
    {
        name: '此生不换',
        url: 'http://music.163.com/song/media/outer/url?id=25638340.mp3',
        cover: 'http://p2.music.126.net/UyDVlWWgOn8p8U8uQ_I1xQ==/7934075907687518.jpg?param=300x300',
        lyrics: '',
        artist: '青鸟飞鱼',
    },
]



</script>

<template>
    <div m-20>
        <TwMusic :songs="songs" title="TW Music" color="text-[#6420AA]" />
    </div>
</template>

<style></style>
